app/controllers/employees_controller.rb

  def index
    @employees = Employee.find(:all, :include => [:department, :location], :conditions => {:status => "Active"})
---
SELECT * FROM "departments" WHERE ("departments"."id" = 1)
SELECT * FROM "employees" WHERE ("employees"."id" = 2)
SELECT * FROM "locations" WHERE ("locations"."id" = 1)