app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT * FROM "employees" LIMIT 1